In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("TSLA_Stock.csv")

In [3]:
df.head()

,Unnamed: 0,Date,Close,High,Low,Open,Volume
0,2701,2021-03-23,220.720001,225.933334,219.169998,225.256668,91475700
1,2702,2021-03-24,210.089996,222.673340,210.036667,222.636673,101385600
2,2703,2021-03-25,213.463333,215.166672,203.166672,204.333328,117674700
3,2704,2021-03-26,206.236664,214.606674,199.963333,213.956665,101558400
4,2705,2021-03-29,203.763336,205.493332,198.673340,205.213333,85911000

In [4]:
df['Date'] = pd.to_datetime(df['Date'])

In [5]:
df.head()

,Unnamed: 0,Date,Close,High,Low,Open,Volume
0,2701,2021-03-23,220.720001,225.933334,219.169998,225.256668,91475700
1,2702,2021-03-24,210.089996,222.673340,210.036667,222.636673,101385600
2,2703,2021-03-25,213.463333,215.166672,203.166672,204.333328,117674700
3,2704,2021-03-26,206.236664,214.606674,199.963333,213.956665,101558400
4,2705,2021-03-29,203.763336,205.493332,198.673340,205.213333,85911000

In [6]:
df['Year'] = df['Date'].dt.year

In [7]:
df.head()

,Unnamed: 0,Date,Close,High,Low,Open,Volume,Year
0,2701,2021-03-23,220.720001,225.933334,219.169998,225.256668,91475700,2021
1,2702,2021-03-24,210.089996,222.673340,210.036667,222.636673,101385600,2021
2,2703,2021-03-25,213.463333,215.166672,203.166672,204.333328,117674700,2021
3,2704,2021-03-26,206.236664,214.606674,199.963333,213.956665,101558400,2021
4,2705,2021-03-29,203.763336,205.493332,198.673340,205.213333,85911000,2021

In [8]:
df.groupby('Year').mean()

      Unnamed: 0       Close        High         Low        Open        Volume
Year
2021      2799.5  261.078519  266.010319  255.586987  260.812778  7.530995e+07
2022      2926.5  306.817557  316.190536  297.752202  307.280477  8.250848e+07

In [9]:
df.groupby('Year').median()

      Unnamed: 0       Close        High         Low        Open      Volume
Year
2021      2799.5  238.210007  241.716667  234.889999  238.118340  70158000.0
2022      2926.5  302.166656  310.835007  293.614990  302.316666  75755100.0

In [13]:
df.groupby('Year').min()

,Unnamed: 0,Date,Close,High,Low,Open,Volume,Month
Year,,,,,,,,
2021,2701,2021-03-23,187.820007,188.736664,182.326660,184.183334,29401800,3
2022,2899,2022-01-03,254.679993,266.899994,233.333328,233.463333,50729100,1

In [10]:
df.groupby('Year').max()

,Unnamed: 0,Date,Close,High,Low,Open,Volume
Year,,,,,,,
2021,2898,2021-12-31,409.970001,414.496674,405.666656,411.470001,188556300
2022,2954,2022-03-23,399.926666,402.666656,378.679993,396.516663,151565700

In [12]:
df.groupby('Year').std()

,Unnamed: 0,Close,High,Low,Open,Volume,Month
Year,,,,,,,
2021,57.301832,58.776349,60.751651,56.329981,58.679113,2.864679e+07,2.705001
2022,16.309506,32.865174,33.954684,32.633122,34.315652,2.312073e+07,0.818416

In [11]:
df['Month'] = df['Date'].dt.month
df.groupby('Month').mean()

,Unnamed: 0,Close,High,Low,Open,Volume,Year
Month,,,,,,,
1,2908.500000,336.722830,349.012334,326.520500,339.770000,9.580032e+07,2022.000000
2,2928.000000,292.961577,301.286843,284.898768,292.789474,7.321719e+07,2022.000000
3,2875.416667,265.410275,271.766667,257.181390,264.034445,8.456901e+07,2021.708333
4,2718.000000,236.539365,241.251747,231.734762,236.427620,9.693424e+07,2021.000000
5,2738.500000,205.584335,210.278999,201.465501,206.239336,9.377637e+07,2021.000000
6,2759.500000,208.973183,212.432725,205.685910,208.752122,7.089844e+07,2021.000000
7,2781.000000,219.711588,223.639840,215.680000,219.840953,6.406426e+07,2021.000000
8,2802.500000,235.081062,238.180455,231.886364,234.811213,5.199885e+07,2021.000000
9,2824.000000,251.317463,253.858095,247.543493,250.604284,5.573876e+07,2021.000000
10,2845.000000,292.783017,296.909206,287.247936,289.953491,7.556209e+07,2021.000000
11,2866.000000,373.554125,382.863017,362.036666,372.588890,9.273021e+07,2021.000000
12,2887.500000,339.629999,348.253938,330.886665,341.477726,6.955308e+07,2021.000000

# Iris Dataset

In [14]:
df1 = pd.read_csv("Iris.csv")
df1.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [16]:
df1.groupby('Species').mean()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm
Species,,,,,
Iris-setosa,25.5,5.006,3.418,1.464,0.244
Iris-versicolor,75.5,5.936,2.770,4.260,1.326
Iris-virginica,125.5,6.588,2.974,5.552,2.026

In [17]:
df1.groupby('Species').median()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm
Species,,,,,
Iris-setosa,25.5,5.0,3.4,1.50,0.2
Iris-versicolor,75.5,5.9,2.8,4.35,1.3
Iris-virginica,125.5,6.5,3.0,5.55,2.0

In [18]:
df1.groupby('Species').max()

                  Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
Species
Iris-setosa       50            5.8           4.4            1.9           0.6
Iris-versicolor  100            7.0           3.4            5.1           1.8
Iris-virginica   150            7.9           3.8            6.9           2.5

In [19]:
df1.groupby('Species').min()

                  Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
Species
Iris-setosa        1            4.3           2.3            1.0           0.1
Iris-versicolor   51            4.9           2.0            3.0           1.0
Iris-virginica   101            4.9           2.2            4.5           1.4

In [20]:
df1.groupby('Species').std()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm
Species,,,,,
Iris-setosa,14.57738,0.352490,0.381024,0.173511,0.107210
Iris-versicolor,14.57738,0.516171,0.313798,0.469911,0.197753
Iris-virginica,14.57738,0.635880,0.322497,0.551895,0.274650

In [22]:
df1.groupby('Species').quantile(0.25)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm
Species,,,,,
Iris-setosa,13.25,4.800,3.125,1.4,0.2
Iris-versicolor,63.25,5.600,2.525,4.0,1.2
Iris-virginica,113.25,6.225,2.800,5.1,1.8